{
    "basic_info": {
      "description_header": "Hi 👋",
      "description": " I'm Noah Dirck, a Full-Stack Developer with a strong passion to learn and create. There is so much to learn in this industry that it can sometimes be overwhelming. I've figured out that finding new projects to feed my curiosity is the antidote to these kinds of worries. You know the old cliche: \"Its not about the destination, its about the journey\". Well it turns out that some cliches dont feel like cliches once they really resonate with you. So, to me, it's not always about the final product (probably a controversial thing to say as a developer). It's about the excitement that comes with the process of learning new technologies. Here's to future projects and staving off imposter syndrome! 🥂",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "MnZ Movie Travel",
        "description": "Team and I built a website where users can explore filming locations from their favorite movies and can also access real-time webcam feed from said locations. Responsibilities included utilizing several APIs to render information on the front end. Designed home page, search page and built the map page which loads the location markers.",
        "images": [
          "images/portfolio/MnZ/mappins.jpg",
          "images/portfolio/MnZ/p2.png",
          "images/portfolio/MnZ/map_cams_result.png"
        ],
        "url": "https://github.com/Niche-Quiche/Frontend_Project",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Vanilla JS"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "Dots",
        "description": "Personal project for practicing Design, made possible with React & Redux. Check it out on Netlify! (currently under construction)",
        "images": [
          "images/portfolio/dots/p1.jpg"
        ],
        "url": "https://noahdirck.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-redux-plain",
            "name": "Redux"
          }
        ]
      },
      {
        "title": "Kackle",
        "description": "Kackle is a social media site that combines your favourite parts of other social media sites and puts it all in one place. My team and I built this project to showcase our skills in Full-Stack Development and to learn new ones along the way.",
        "images": [
          "images/portfolio/kackle/klogo.png"
        ],
        "url": "https://github.com/dess890/kackle",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-react-original",
            "name": "Redux"
          },
          {
            "name": "Node.JS",
            "class": "devicon-nodejs-plain"
          },
          {
            "name": "Express",
            "class": "devicon-express-original"
          },
          {
            "name": "PostgreSQL",
            "class": "devicon-postgresql-plain"
          }
        ]
      }
    ]
    
  }